package com.ccs.romanticadventure;

import android.annotation.SuppressLint;
import android.content.pm.ActivityInfo;
import android.graphics.Color;
import android.media.MediaPlayer;
import android.os.Bundle;
import android.os.Handler;
import android.text.method.ScrollingMovementMethod;
import android.util.DisplayMetrics;
import android.util.Log;
import android.util.TypedValue;
import android.view.View;
import android.view.ViewGroup;
import android.view.WindowManager;
import android.webkit.JavascriptInterface;
import android.webkit.WebChromeClient;
import android.webkit.WebResourceRequest;
import android.webkit.WebSettings;
import android.webkit.WebView;
import android.webkit.WebViewClient;
import android.widget.Button;
import android.widget.LinearLayout;
import android.widget.RelativeLayout;
import android.widget.TextView;
import android.widget.Toast;

import com.ccs.romanticadventure.data.PreferenceConfig;
import com.ccs.romanticadventure.system.ExitConfirmationDialog;

import java.util.HashMap;
import java.util.Map;
//супер клас головного вікна, бо тільки так буде працювати код підтвердження виходу з програми

public class Game_First_Activity extends MainActivity {

    private WebView webView;
    private int katya, choose, textIndex = 0,value, indexArray, delayBetweenCharacters = 40, //затримка між спавном символів
            delayBetweenTexts = 2000; // затримка між спавнінгом іншого тексту з масиву;

    private static final int dialogContainerId = View.generateViewId(); // Генерируем уникальный идентификатор для контейнера

    float volumeLvl;
    MediaPlayer mediaPlayer;
    boolean type, historyBlockIsVisible = false, animationInProgress;
    private Button history, save, load,buttonElement, buttonSecondElement;
    private RelativeLayout bg;
    private TextView textElement, nameElement;
    private String[] textArray = {"[Я прокидаюсь від звука противного будильника]",
            "[Я намагаюсь нащупати окуляри...",
            "[Знайшов окуляри...]",
            "Одягнути свої окуляри?",
            "[Я почув дивні звуки. Один з них шиплячий, другий - чавкання, а третій - голосний вигук]",
            "[Через хвилину я зрозумів, що це була кішка]",
            "[Ще через декілька секунд чавкала моя сестра Катя]",
            "Катя, не чавкай!",//TODO в блок імені Мама
            "[Я взувся у свої капці і відчинив двері]",
            "[Я пройшов через кімнату сестри і відразу попав до кухні]",
            "[Там стояла мама й там же сиділа за столом моя сестра, наминаючи канапки]",
            "Доброго ранку, нарешті ти прокинувся", //TODO в блок імені Мама
            "Мене терміново викликали на роботу, тож зайди в магазин, будь ласка", //TODO в блок імені Мама
            "[Мама просунула пару купюр, котрими я повинен розрахуватися за покупки]",
            "...",
            "[Дивно, але списку не було...]",
            "[Чи потрібно запитати про список?]",
            "Точно! Ледт не забула, Катю, дай список брату.",//TODO в блок імені Мама
            "[Я дивлюся, як мама збирається та виходить на вулицю]",
            "Вань, купи мені цукерки «Корівка»", //TODO  блок імені Катя і також додати лапки для цукерок (взяти з вьорду) і тепер замість "???" писати в репліку Івана його ім'я
            "...",
            "[Вибору нема...]",
            "Добре, я куплю тобі цукерки, але тільки обіцяй, що не будеш докучати сьогодні ввечері",//TODO в блоці імені - Іван
            "І приставка сьогодні моя!", //TODO в блоці імені Іван
            "Але я повинна пройти боса в грі...",//TODO додати в блоці імені - Катя
            //25 індекс значення на 28 рядку
            "...",
            "Тоді не куплю",//TODO в блок імені Іван
            "[Я забираю список і йду до вхіднох дверей.]",
            "Ну хоть часик, дасиш пограти?...",//TODO в блоці імені Катя
            //29 index on 33 line
            "Дати Каті годинку пограти ввечері?",

            //TODO подветвь "Хорошый братик"
            "Ну...",//TODO в блок імені Іван
            "Годинку дам",//TODO в блок імені Іван + додати +1 до катіної лояльності
            "Добре, домовились",//TODO в блок імені Катя
            "[Я почав збиратися в магазин.]",
            "[Поглянувши на тумбу, я згадав, що цю шапку подарував мені тато.]",
            "[Він привіз мені з Польщі.]",
            "[Я вийшов з дому, сестра закрила за мною двері.]",
            "Хочеться прогулятись. Піду-но я через ліс...",//TODO в блок імені Іван
            "...",
            //40 index in 46 line
            "Через 15 хвилин я захожу в невеличкий магазин «Універсал»",//TODO в блок імені лапки додати з Вьорду

            //TODO підгілка "Поганий братик"
            "[Катя на мене подивилася собачими очима]",
            "[Вона опустила голову, встала і побігла у свою кімнату не доївши]",
            "[Я тільки фиркнув у її сторону і почав збиратися до магазину]",
            "[Я вийшов з дому і пішов через ліс, бо так швидше]",
            "[Через 13 хвилин я заходжу в магазин «Уніка 12/7»]",//TODO лапки....


            //TODO гілка Магазін Уківерсал (не глава)
            //TODO підгілка гарний братик в магазині (тут взагалі буде й поганий братик в магазині) Треба через переевірку sharedPreferences перевірити які бали щоб вивести текст
            "[Я зайшов у магазин та взяв візок]",
            "[Я купив усі потрібні речі та підійшов до стійки з цукерками]",
            "[Я підійшов до коробки з цукерками «Корівка»]", //TODO Лапки з вьорду
            "[Взяв 100 - 120 грам]",
            "[Зайду я до лісу]",
            "Ех... якась природа України прекрасна. Що не глянь у будь-який бік, то одразу ідеальні пейзажі!", //TODO Добавить имя Ваня
            "[Люблуюся видами лісу]",
            "Що ж, настав час повертатися",//todo имя ваня
            "[Ідучи додому, побачив озеро, біля якого я люблю проводити час на єдиному, але зараз уже не час]",
            "[БАЦ]",
            "ай-ай-ай. Треба ж було так спіткнутися... Блін, тепер незручно йти, а якщо запізнюся, то мама буде гукати...",//todo Ваня
            "[Бачу подорожник]",
            "[Зав'язавши коліно подорожником я почав прискорюватися, але так і до кінця шкандибал]",
            "[Прийшовши додому, мама вже була вдома, вона подивилася на мене]",
            "Боже, де тебе носило? Швидко залітай додому, зараз лікуватимемо тебе, незграбного",//todo mum
            "[Я слухняно зайшов, роззувся і пішов у свою кімнату]",
            "Ваня, ти де?",//TODO MUM
            "ідууууууу.....",//todo vanya
            "[Повертаючись назад, я взяв пакет біля входу і пішов у кухню]",
            "О, молодець, грошей вистачило?",//todo mum
            "ще 20 гривень залишилось",//todo vanya
            "Можеш собі залишити",//todo mum
            "Дякую",//todo vanya
            "[І стало занадто тихо]",
            "[Ой, зовсім забула, зараз лагодити будемо тебе]",
            "[Мама взяла бинт і перекис і почала обмотувати рану на коліні]",
            ".....",
            "Ось і готово",//todo mum
            "Давно ти не видавав жодних звуків, коли тебе ми лікували",//todo mum
            "Ага.... Дякуємо за допомогу",//todo vanya
            "Прийму як подяку в тому випадку, якщо будеш уважніше",//todo мама
            "Добре...",//todo vanya
            "[Я чую кроки]",
            "[Виявляється це сестра]",
            "Якщо все в зборі, будете їсти?",//Мама:
            "Без нього",//Сестра
            "Катя розвертається і йде назад до себе в кімнату",
            "Що трапилося вже з вами?",//мама
            "Сам в ауті",//Ваня,
            "Зрозуміло, можливо перехідний вік",//мама
            "Можливо",//ваня
            "[Мама пішла до Каті і вони щось там нерозбірливо гомоніли протягом 20 хвилин, поки ти в цей час вечеряв сам ]",
            "[Майже закінчивши вечерю, мама і Катя заходять на кухню]",
            "...",//Сестра
            "Я образилась не через тебе, а просто в моєму серіалі була непередбачувана кінцівка на яку я була дуже зла",//сестра
            "Зрозуміло",
            "Мама: Ось і закінчимо. Сподіваюся таких ситуацій буде рідко",
            "Дааааа ....", //сестра
            "Добре",//ваня
            "Катю, йди їсти. Синку, тобі є чим зайнятися?",//мама
            "Так звичайно",//ваня
            "[Насправді обдурив бо нічого цікавого в моєму житті та й кімнаті немає]",
            "[Я йду до своєї кімнати, роздягаюся, лягаю на ліжко і засинаю]",
            "[Я опинився в лісі... У дуже тіному лісі...]",
            "цікаво...",//ваня
            "звуки крику ведмедя",//TODO звук запустити
            "Бігти звідси до біса... Яке щастя що це сон",//ваня
            "Я так не думаю, хе-хе",//???
            //TODO "Тут чорний екран",
            "А де світло?",//Ваня
            "Бу",//???
            //TODO "Сповним фотку ведмедика",
            "[Я рефлекторно вдарив її по обличчю]",
            " Ай-ай-ай ... Боляче",//???
            "Ти хто?",//Ваня
            "Можеш називати мене Ведмедик, я твій страх",//Ведмедик
            "[Мій страх? Та чорт з ним, це ж дівчинка каже що звати її треба в чоловічому роді]",
            "Д-добре?...",//Ваня
            "Розумничка що підхоплюєш все на ходу",//Ведмедик
            "...",//ваня
            "Люблю таких, хе-хе",//Ведмедик
            "Слава Богу, що це лише сон",//ваня
            "Це так, але ти у своєму сні, де керую саме я і з цього тільки я можу тобі дозволити прокинутися, хе-хе",//медведик
            "...",//Ваня
            "Бачу що тобі лячно",//Ведмедик
            "Є таке",//Ваня
            "[Треба вдавати, що в мене залізні яйця, але насправді я зараз закричу]",
            "Хм, я думаю поки що для нашої першої зустрічі. Так що на цій ноті попрощаємося. Побачимося вночі, хе-хе",//ведмедик
            "[Я різко встаю з ліжка весь у поту]",
            "Годинник показує 6 годин ранку... Серйозно?",//ваня
            "[Ну, мій портфель завжди зібраний так що може піти до школи]",
            "[Так як я вийшов рано, то можна і лісом прогулятися]",
            "Сподіваюся їжа в їдальні буде нормальна",//Ваня
            "[Піти прямо зараз до школи?]",
            //TODO так 117 element? 116 index?
            "Що ж робити нічого, піду до школи",
            "Ні",
            "* Ідучи лісом, я уважно стежив за всім, що відбувається навколо мене, щоб не впасти як учора",
            "*Через годину, я нарешті в школі",
            "[Уроки йдуть повільно, а я як завжди не слухаю, а просто витріщаюся у вікно]",
            "[...]",
            "Затримка на 5 сек",
            "[Так у мене проходить щодня]",
            "[Друзів у мене немає]",
            "[Мені вони не потрібні]",
            "[...]",
            "[Єдине що я хочу, то це дівчину]",
            "[Звичайно, бажано щоб були однолітки, але на рік старше, теж допустимо]",
            "Звук дзвінка",
            "фух ... Нарешті додому.",
            "[Цього разу я піду додому швидкою дорогою, не через ліс, а то відпочити полювання]",
            "Тут затримка на пару секунд із фоном лісу",
            "...",
            "Нарешті вдома",
            "[Увійшовши додому, я бачу як Катя їсть пластівці]",
            "Привіт, як справи?",
            "нормально, мама якщо що, пішла за покупками",
            "Зрозуміло, ну якщо що, я посплю тоді",
            "Та роби що хочеш",
            "[Я залітаю в свою кімнату, роздягаюся і стрибаю на ліжко]",
            "...",
            "[Я різко засинаю]",
            "???: Привіт!",//В???
            "...",//Ваня
            "Ваня: Привіт",//Ваня
            "Ведмедик І так ... Ми не закінчили в минулу зустріч",
            "Ваня: та мені і минулого разу вистачило, якщо чесно",
            "Ведмедик: Ха-ха, ти кумедний)",
            "Ваня: ...",
            "ведмедик: І так... Сьогодні поговоримо про тебе. Ти дивна людина, често кажучи",
            "Ваня: ...",
            "Ведмедик: Таких як ти - мало і вони в цілому не завжди розуміють де ...",
            "Ведмедик: Хм...",
            "Ведмедик: Краще не говоритиму",
            "Ваня: тобто ти говориш мені про проблеми. а саму проблему не хочеш говорити?",
            "Ведмедик: Саме",
            "Ваня: ну це ж мій сон, я хочу що б ти сказала мені",
            "Ведмедик: Нагадаю, це твій сон, але контролюю тут я",
            "Чорт я зовсім забув",
            "Ведмедик: Ну, єдине що я тобі скажу - будь акуратніше",
            "Ваня: Де саме? У ногах, у людях? Перестань головоломки ставити. Хлопці не розуміють натяків, скажи прямо",
            "Ведмедик: Ти кумедний, так би з'їла, ну добре... Просто якщо найменше питання буде тебе в голові, то просто детально проаналізуй",
            "Ваня: ...",
            "Ваня: Гаразд?",
            "Ведмедик: Та ти сам зрозумієш)",
            "Ваня: Ясно...",
            "Ведмедик: Хмарно",
            "Ведмедик: гаразд, на цьому поки все",
            "Ваня: Так-так",
            "*Я раптово прокинувся*",
            "Ваня: тепер знову до школи",
            "Я одягнувся, взяв їжу, яка мама від учорашнього дня залишила *",
            "Знову пройдуся довгим шляхом",
            "...",
            "*Яка краса в лісі*",
            "Прийшовши до школи, я сів за парту і знову провалився в хмари",
            "*звук на перерву, піду-но я прогуляюся*",
            "*Я вийшов зі школи, щоб намотати кілька кіл у коло поля *",
            "Я побачив ученицю, яка сидить на лавочці і стежить за мною",
            //no
            "Ваня: Де саме? У ногах, у людях? Перестань головоломки ставити. Хлопці не розуміють натяків, скажи прямо",
            "Ведмедик: Ти кумедний, так би з'їла, ну добре... Просто якщо найменше питання буде тебе в голові, то просто детально проаналізуй",
            "Ваня: ...",
            "Ваня: Гаразд?",
            "Ведмедик: Та ти сам зрозумієш)",
            "Ваня: Ясно...",
            "Ведмедик: Хмарно",
            "Ведмедик: гаразд, на цьому поки все",
            "Ваня: Так-так",
            "*Я раптово прокинувся*",
            "Ваня: тепер знову до школи",
            "Я одягнувся, взяв їжу, яка мама від учорашнього дня залишила *",
            "Знову пройдуся довгим шляхом",
            "...",
            "*Яка краса в лісі*",
            "Прийшовши до школи, я сів за парту і знову провалився в хмари",
            "*звук на перерву, піду-но я прогуляюся*",
            "*Я вийшов зі школи, щоб намотати кілька кіл у коло поля *",
            "Я побачив ученицю, яка сидить на лавочці і стежить за мною",
            //
            "*Я не буду подходить к ней так как мне нет дела к ней, лучше пойду в клас*",
            "*Зайдя в класс, я опять провалился в мечты*",
            "Ваня: Ну слава Богу, это конец",
            "*Я встал и пошёл дальше гулять по територии школы*",
            "*На том же месте сидит та девочка которая была и в обед*",
            "*Я её никогда не видел, наверное потому что не обращаю внимание на окружающих*",
            "*Я сел с другой стороны поля*",
            "*Посидел пару минут и лёг. Я смотрел в небо до того момента, как не уснул*",
            "Мишка: Бу",
            "Ваня:..",
            "Мишка: Что, уже не пугает?",
            "Ваня: не совсем уже",
            "*Кому я это говорю?*",
            "Мишка: Ну ладно, как знаешь, я буду страшнее тогда",
            "Ваня:...",
            "Ваня: Так что, зачем я опять здесь?",
            "Мишка: А, точно. Ты же видел ту девочку?",
            "Ваня: Мою маму?",
            "Мишка: Шутник)",
            "Ваня: Весь в тебя",
            "Мишка: Ну ладно, вот та девчонка которая навпротив тебя сидит - её нельзя допустить к твоему сердцу",
            "Ваня: Что?",
            "Мишка: Что бы было тебе легче, скажу тебе сразу - она не настоящая",
            "Ваня: То есть? Не искренная с эмоциями?",
            "Мишка: ...",
            "Ваня: И это тоже",
            "Ваня: И что ты хочешь что бы я сделал?",
            "Ваня: Избегай её",
            "Ваня: Зачем?",
            "Мишка: Просто сделай",
            "Мишка: Зачем?",
            "Ваня: Девушку хочу я!",
            "Мишка: ха",
            "Мишка: ха-ха",
            "Мишка: ха-ха-ха-ха-ха-ха-ха-ха",
            "Мишка: Ну да, ты же парень...",
            "Ваня: В смысле? что то не так?",
            "Мишка: Нет, просто пожалуйста, избегай её и ударь её когда будешь один, если получиться - окей, встречайся и делай что хочешь",
            "Ваня: Окей",
            "Мишка: Я много букв сказала... На этом всё",
            "*Я проснулся и открыл глаза*",
            "*Та девочка смотрит на меня и стоит возле меня*",
            "???: П-Привет",
            "Ваня: Эм... Привет?",
            "*Та девочка улыбнулась*",
            "...",
            "*Милота....*",
            "???: Я... Я Соня",
            "Ваня: Я Ваня",
            "Соня: Я знаю",
            "*Мне не послышалось?*",
            "Соня: Ты мне нравишься....",
            "Ваня: Понятно....",
            "Соня: ...",
            "Соня: Давай будем гулять с тобой часто?",
            "*Хм... А где подвох? Там же Мишка ещё говорила что нужно быть осторожным*",
            //no
            "Ваня: Ні, дякую",
            "Соня: П-чому?",
            "Ваня: Не потребую",
            "*Ведмедик, я просрав перший і останній шанс!!!",
            "Соня: Л-ладно",
            "*Соня єхидно посміхнулася*",
            "*Мда...*",
            "Соня: НУ що ж... Ти точно не хочеш?",
            "Ваня: Точно не хочу",
            "Соня: Точно?",
            "Ваня: Точно",
            "Соня: Точно точно?",
            "Ваня: ТАК!",
            "Соня: То...",
            "Ваня: ТАК!!!!!",
            "*Соня ще більше посміхнулася*",
            "Соня: Ну що ж...",
            "Соня: Гаразд... Скоро побачись",
            "*Соня пішла*",
            "Ваня: Що це за нахрен було?",
            "Ваня...",
            "Ваня: Що ж, піду додому через ліс. П'ятниця ж, так що поспішати нікуди",
            "*Я встав і пішов*",
            "...",
            "*Я пішов через ліс*",
            "Ваня: Зайду я на пляж біля озера",
            "Ваня: Як тут красиво",
            "Ваня: Хто тут?",
            "???:",
            "Ваня: виходь, я не битиму",
            "З кущів вийшла Соня",
            "Ваня: ...",
            "Соня: ...",
            "Ваня: Ну, що ти робиш тут",
            "Соня: я тут часто гуляю",
            "Ваня: Я думав тут ніхто не може бути так як це місце дуже далеке від місцевості",
            "Соня: Це правда",
            "*У руці Соні виглядає мокра ганчірка і ніж в іншій руці*",
            "Ваня: Навіщо тобі ніж і ганчірка, ще й мокра",
            "*Соня почала наближатися*",
            "Соня: Зараз покажу",
            //yes
            "*Я резко бобежал домой*",
            "*Надо сваливать от сюда*",
            "*Эта странная девочка погналась за мной и странно смеясь, как будто для неё это игра, где приз это моя жизнь.*",
            "*я бежу по лесной тропе*",
            "/ЧТО ЖЕ ЭТО ВСЁ ЗА ЧЕРТОВШИНА/",
            "/КАК БУД-ТО БЕГУ УЖЕ ВЕЧНОСТЬ/",
            "*Перепрыгиваю ров*",
            "*я спотыкаюсь о камень*",
            "#Мерзские звуки похожие на смех#",
            //yes
            "Иван: ИДИ К ЧЁРТУ",
            "*Я замахиваюсь и спеша кидю камень в тёмный силуэт*",
            "#КРИК#",
            "*Адреналин в крови Ивана поднялся настолько, что он не понял как оказался у двери дома*",
            "*Распахивает дверь дома*",
            "Безумные глаза, полные страха смотрят на семью которая накрывают на стол. Семья готовится к празднику.",
            "Катя: ЧТО ТО СЛУЧИЛОСЬ БРАТИК ?",
            "*Нежилая испугать родных, ябыстро попытался собраться и ответил.*",
            "Иван: Да так.. ничего.. просто не хотел опоздать к столу",
            "#СТУК В ДВЕРЬ#",
            "*меня покрыл пот, ноги заледенели и затряслись, глаз задёргался*",
            "*Сестра пошла открывать дверь, я попытался что то возразить, но не нашёл нужных слов.*",
            "*Дом сразу наполнился шумом. Это оказались гости пришившие на праздник.*",
            "*Увидев что это были всего лишь гости, я успокоился и пошёл тоже их встречать.*",
            "Гость: ИВАН! ТЫ НАС РАЗВЕ НЕ ЗАМЕТИЛ? ТЫ ПРОБИГАЛ ВОЗЛЕ НАС.. МИНУТЫ 3 НАЗАД.",
            "Иван: ДА НЕ ПРИЗНАЛ.. СПЕШИЛ ДОМОЙ Ответил Иван опустив взгляд на порог и увидел пару капель крови.",
            "*Я вернулся в свою комнату и разделся*",
            "Ваня: Нужно теперь помыться",
            "*Я захожу в душевую и тщательно отмываюсь от грязи и крови*",
            "???: привет",
            "*Я подскользнулся и упал*",
            "Ваня: К-как?",
            "Соня: Хе-хе",
            "Ваня: ...",
            "Соня: Ты только мой!",
            "Ваня: нет, я говорил что не буду, вот и всё",
            "Соня: Сейчас я у тебя не спрашиваю",
            "*БАЦ*",
            "*Соня меня стукнула по голове*",
            "*Я очнулся в лесу*",
            "*Внезапно появилась Мишка*",
            "Мишка: О, а ты молодец. Долго пробыл",
            "Ваня: Ч-что?",
            "Мишка: Ты что, даже сейчас не понял?",
            "Ваня: нет, а что?",
            "Мишка: А как ты думаешь, как девочка может попасть в дом, где все окна закрыты и гости в доме?",
            "Ваня: ...",
            "Ваня: Может быть всё что угодно, если что.",
            "Мишка: ...",
            "Мишка: Ладно, ты так и не понял, ты же ещё и подросток... Надеюсь ты скоро всё поймёшь",
            "Ваня: ...",
            "Мишка: Увидимся, я надеюсь...",
            "*Я резко проснулся*",
            "Ваня: Стоп, а где я?",
            "*Я привязан к стульчику*",
            "Ваня: Ч-что?",
            "Ваня: Где я?",
            "Ваня: П-почему я привязан?",
            "Ваня: К-как?",
            "*Я огляделся*",
            "*...*",
            "*Никого нет*",
            //yes
            "Ваня: Что ж... Вибора нет...",
            "Ваня: СПАСИТЕЕЕЕЕЕЕ",
            "*Я кричал секунд 20 и внезапно забежали гости и моя семья и я оказался в своей комнате*",
            "Все в один голос: что случилось?",
            "*Сзади выглядывает Соня*",
            "Ваня: СЗАДИ!!!!",
            "*ВСЕ ПОСМОТРЕЛИ НАЗАД*",
            "ВСЕ: Что? Тут никого нет...",
            "*Что же за чёртовщина тут твориться?*",
            "Ваня: Наверное показалось....",
            "Гости: ты так не шути",
            "Ваня: я наверное посплю",
            "*Все ушли, а я иду спать*",
            "*Я уснул...*",
            "Мишка: как дела?",
            "Ваня: ...",
            "Мишка: как я говорила.... Думай...",
            "Ваня:...",
            "Мишка: Что?",
            "Ваня: То есть всё что ты говорила на счёт вымешленых - это правда?",
            "Мишка: Наконец-то допёрло.",
            "Ваня: Выходит что у меня проблемы с головой?",
            "Мишка: Та не совсем. Я с тобой вот общаюсь и нормально. Ну ты понял",
            "Ваня: То есть мне нужно сходить к доктору?",
            "Мишка: Как знаешь....",
            //no
            "Ваня: Ну, я не думаю, что это нужно",
            "*Мишка немного улыбнулась*",
            "Мишка: Ну, мне приятно будет",
            "Ваня: Ты всё равно моя фантазия",
            "Мишка: Ну и?",
            "Ваня: Ладно, тогда будем видеться каждую ночь?",
            "Мишка: Конечно",
            "Ваня: Тогда, до встречи",
            "Мишка: Агась",
            "*Я проснулся и начал заниматься привычными делами.*",
            "*Это происхоило днем за днём*",
            "*Я всё большое проводил время во сне лиш бы не видеть Соню, так как Мишка меня личила*",
            "*И одного дня я увидел, как я смтрю на самого себя, но моё тело лежит на кровати, а я стою перед ним*",
            "*Я в пал кому...*",
            //ending 1
    };
    private HashMap textMap;

    @SuppressLint({"SetJavaScriptEnabled", "WrongViewCast"})
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_game_first);
        setRequestedOrientation(ActivityInfo.SCREEN_ORIENTATION_USER_LANDSCAPE);
        getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN, WindowManager.LayoutParams.FLAG_FULLSCREEN);
        choose = PreferenceConfig.getChoose(this);
        history = findViewById(R.id.buttonHistory);
        save = findViewById(R.id.fastSave_btn);
        load = findViewById(R.id.fastLoad_btn);
        bg = findViewById(R.id.bg);
        textElement = findViewById(R.id.dialog);
        nameElement = findViewById(R.id.name);
        type = PreferenceConfig.getAnimSwitchValue(this);
        buttonElement = findViewById(R.id.first_btn);
        buttonSecondElement = findViewById(R.id.second_btn);
        value = PreferenceConfig.getValue(this);
//        textMap = new HashMap();
//        textMap.put("[Я прокидаюсь від звука противного будильника]", "Думки");
//        textMap.put("[Я намагаюсь нащупати окуляри...", "Думки");
//        textMap.put("Одягнути свої окуляри?", "");
//        textMap.put("[Я почув дивні звуки. Один з них шиплячий, другий - чавкання, а третій - голосний вигук]", "Думки");
//        textMap.put("[Через хвилину я зрозумів, що це була кішка]", "Думки");
//        textMap.put("[Ще через декілька секунд чавкала моя сестра Катя]", "Думки");
//        textMap.put("Катя, не чавкай!", "Мама");
//        textMap.put("[Я взувся у свої капці і відчинив двері]", "Думки");





        View decorView = getWindow().getDecorView();
        int uiOptions = View.SYSTEM_UI_FLAG_HIDE_NAVIGATION
                | View.SYSTEM_UI_FLAG_FULLSCREEN;
        decorView.setSystemUiVisibility(uiOptions);
        volumeLvl = PreferenceConfig.getVolumeLevel(this);
        mediaPlayer = MediaPlayer.create(this, R.raw.school);
        mediaPlayer.setLooping(true);
        mediaPlayer.setVolume(volumeLvl, volumeLvl);
        buttonElement.setVisibility(View.INVISIBLE);
        buttonSecondElement.setVisibility(View.INVISIBLE);

        history.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
            if(!historyBlockIsVisible) {
                showHistoryDialog();
            }else{
                hideHistoryDialog();
            }
            }
        });

        animateText();

        load.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                quickLoad();
            }
        });
        save.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                quickSave();
            }
        });
        buttonElement.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                firstBtn();
            }
        });
        buttonSecondElement.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                secondBtn();
            }
        });





    }
    @Override
    public void onBackPressed() {
        ExitConfirmationDialog.showExitConfirmationDialog(this);
    }

    private void quickLoad() {
        textElement.setText("");
        textIndex = value;
    }

    private void quickSave() {
        // Реализация быстрого сохранения
        PreferenceConfig.setValue(getApplicationContext(), textIndex);
    }

    private void showHistoryDialog() {
        historyBlockIsVisible = true;
        // Создание диалогового контейнера
        LinearLayout dialogContainer = new LinearLayout(this);
        dialogContainer.setId(dialogContainerId);
        dialogContainer.setLayoutParams(new ViewGroup.LayoutParams(
                convertDpToPx(300), // Ширина контейнера
                convertDpToPx(200) // Высота контейнера
        ));
        dialogContainer.setOrientation(LinearLayout.VERTICAL);
        dialogContainer.setBackgroundColor(Color.WHITE); // Белый цвет фона
        dialogContainer.setPadding(convertDpToPx(10), convertDpToPx(10), convertDpToPx(10), convertDpToPx(10)); // Отступы внутри контейнера
        dialogContainer.setBackgroundResource(R.drawable.pink_bg); // Граница контейнера
        dialogContainer.setX(getScreenWidth() / 2f - convertDpToPx(150)); // Положение по горизонтали
        dialogContainer.setY(getScreenHeight() / 2f - convertDpToPx(100)); // Положение по вертикали

        // Создание элемента для отображения текста
        LinearLayout textContainer = new LinearLayout(this);
        textContainer.setLayoutParams(new LinearLayout.LayoutParams(
                ViewGroup.LayoutParams.MATCH_PARENT,
                ViewGroup.LayoutParams.MATCH_PARENT
        ));
        textContainer.setOrientation(LinearLayout.VERTICAL);
        textContainer.setScrollbarFadingEnabled(false);
        textContainer.setVerticalScrollBarEnabled(true);
        textContainer.setHorizontalScrollBarEnabled(false);

        // Добавление каждой строки из массива в элемент текста
        for (int i = 0; i < textIndex; i++) {
            TextView textView = new TextView(this);
            textView.setLayoutParams(new LinearLayout.LayoutParams(
                    ViewGroup.LayoutParams.MATCH_PARENT,
                    ViewGroup.LayoutParams.WRAP_CONTENT
            ));
            textView.setText(textArray[i]);
            textView.setTextSize(TypedValue.COMPLEX_UNIT_SP, 14);
            textView.setLineSpacing(0, 1.5f);
            textContainer.addView(textView);
            Log.d("TextIndex", String.valueOf(textIndex));
        }

        // Добавление элемента текста в диалоговый контейнер
        dialogContainer.addView(textContainer);

        // Добавление диалогового контейнера в корневую разметку активности
        ((ViewGroup) getWindow().getDecorView().getRootView()).addView(dialogContainer);
    }
    // Метод для преобразования dp в px
    private int convertDpToPx(int dp) {
        float scale = getResources().getDisplayMetrics().density;
        return (int) (dp * scale + 0.5f);
    }

    // Метод для получения ширины экрана
    private int getScreenWidth() {
        DisplayMetrics displayMetrics = new DisplayMetrics();
        getWindowManager().getDefaultDisplay().getMetrics(displayMetrics);
        return displayMetrics.widthPixels;
    }

    // Метод для получения высоты экрана
    private int getScreenHeight() {
        DisplayMetrics displayMetrics = new DisplayMetrics();
        getWindowManager().getDefaultDisplay().getMetrics(displayMetrics);
        return displayMetrics.heightPixels;
    }

    private void hideHistoryDialog() {
        historyBlockIsVisible = false;
        ViewGroup rootView = (ViewGroup) getWindow().getDecorView().getRootView();
        View dialogContainer = rootView.findViewById(dialogContainerId);
        if (dialogContainer != null) {
            rootView.removeView(dialogContainer);
        }
    }

    private void animateText() {
        if (!type) {
            return;
        }
        textElement.setText(""); // Очищаем текстовый элемент

        String newText = textArray[textIndex];
        if (newText.equals("росії немає") || newText.equals("абра")) {
            nameElement.setText("Степан");
        } else {
            nameElement.setText("???"); // Очищаем текст, если условие не выполняется
        }

        animateFrame(0);
    }

    private void animateFrame(final int i) {
        String newText = textArray[textIndex];
        new Handler().postDelayed(new Runnable() {
            @Override
            public void run() {
                textElement.append(Character.toString(newText.charAt(i))); // Добавляем символ в текстовый элемент

                if (i < newText.length() - 1) {
                    animateFrame(i + 1);
                } else {
                    new Handler().postDelayed(new Runnable() {
                        @Override
                        public void run() {
                            if (!type) {
                                return;
                            }
                            textIndex++;

                            if (textIndex == 4 || textIndex == 17 || textIndex == 29) {
                                buttonElement.setVisibility(View.VISIBLE);
                                buttonSecondElement.setVisibility(View.VISIBLE);
                                animationInProgress = false;
                                return;
                            } else {
                                buttonElement.setVisibility(View.GONE);
                                buttonSecondElement.setVisibility(View.GONE);
                            }

                            buttonElement.setOnClickListener(new View.OnClickListener() {
                                @Override
                                public void onClick(View v) {
                                    firstBtn();
                                }
                            });
                            buttonSecondElement.setOnClickListener(new View.OnClickListener() {
                                @Override
                                public void onClick(View v) {
                                    secondBtn();
                                }
                            });
                            animationInProgress = true;
                            animateText();
                            indexArray = i;
                        }
                    }, delayBetweenTexts);
                }
            }
        }, delayBetweenCharacters);
    }
    private void firstBtn(){

        switch (textIndex){
            case 3:
                textIndex = 4;
                break;
            case 17:
                nameElement.setText("???");
                textElement.setText("А що ж мені купити? Список дасиш, як минулого разу?");
                textIndex = 18;
                break;
        }

    }
    private void secondBtn(){
        switch (textIndex){
            case 3:
                nameElement.setText("???");
                textElement.setText("Ні, так не піде");
                textIndex = 3;
                break;
            case 17:
                nameElement.setText("???");
                textElement.setText("А що ж мені купити? Список дасиш, як минулого разу?");
                textIndex = 18;
                break;
        }


    }



}
